# pandas
* filtering
* sorting
* usefull methods
* groupby 
* merge

In [3]:
import pandas as pd
from datetime import datetime

# Define the data as a list of dictionaries with 10 student records
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Mathematics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Computer Science', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df : pd.DataFrame = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Show the DataFrame
display(students_df)

# Verify the data types
display(students_df.info())

C:\Users\parta\AppData\Local\Temp\ipykernel_8024\367646798.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   roll_no            10 non-null     int64
 1   name               10 non-null     object
 2   father             10 non-null     object
 3   course             10 non-null     object
 4   date_of_admission  10 non-null     datetime64[ns]
 5   fee                10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 612.0+ bytes

None

In [4]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# Define the schema using SchemaModel
class StudentSchema(pa.SchemaModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True  # Automatically coerce types if possible
        strict = True  # Ensure all columns are accounted for in the schema

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Validate the DataFrame
validated_df = StudentSchema.validate(students_df)

print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

# apply the filter or filter functions on dataframe

In [5]:
students_df.head(1)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [6]:
students_df.course.value_counts()

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [7]:
students_df.course.value_counts(dropna=False)#also counts null cells values

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [8]:
students_df.course.value_counts(dropna=False, normalize=True)# this will change into percentage

course
Physics      0.3
Chemistry    0.1
Biology      0.1
Economics    0.1
History      0.1
Geography    0.1
English      0.1
Art          0.1
Name: proportion, dtype: float64

In [9]:
students_df.course.value_counts(dropna=False, normalize=True)*100 # this will change into percentage real

course
Physics      30.0
Chemistry    10.0
Biology      10.0
Economics    10.0
History      10.0
Geography    10.0
English      10.0
Art          10.0
Name: proportion, dtype: float64

In [10]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [5]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Set a seed for reproducibility
np.random.seed(0)

# Define the number of transactions
num_transactions = 1000

# Generate random dates within the current year
current_year = datetime.now().year
start_date = datetime(current_year, 1, 1)
end_date = datetime.now()

# Generate a list of random dates within the year
random_dates = [start_date + timedelta(days=np.random.randint(0, (end_date - start_date).days))
                for _ in range(num_transactions)]

# Generate a list of random fee amounts
random_fees = np.random.randint(low=1, high=5000, size=num_transactions)

# Create the DataFrame
fee_transactions = pd.DataFrame({
    'date': random_dates,
    'fee': random_fees
})

# Sort by date for readability
fee_transactions.sort_values('date', inplace=True)

# Reset index after sorting
fee_transactions.reset_index(drop=True, inplace=True)

print(fee_transactions)
print(fee_transactions)

          date   fee
0   2024-01-01  4815
1   2024-01-01  3116
2   2024-01-01  2299
3   2024-01-01  1126
4   2024-01-01  2828
..         ...   ...
995 2024-02-29  1206
996 2024-02-29   815
997 2024-02-29   595
998 2024-02-29  2913
999 2024-02-29  3357

[1000 rows x 2 columns]
          date   fee
0   2024-01-01  4815
1   2024-01-01  3116
2   2024-01-01  2299
3   2024-01-01  1126
4   2024-01-01  2828
..         ...   ...
995 2024-02-29  1206
996 2024-02-29   815
997 2024-02-29   595
998 2024-02-29  2913
999 2024-02-29  3357

[1000 rows x 2 columns]

In [6]:
import pandas as pd

pd.cut(fee_transactions.fee,
       [1,500,1000,2000,3000,4000,5000])

0      (4000, 5000]
1      (3000, 4000]
2      (2000, 3000]
3      (1000, 2000]
4      (2000, 3000]
           ...
995    (1000, 2000]
996     (500, 1000]
997     (500, 1000]
998    (2000, 3000]
999    (3000, 4000]
Name: fee, Length: 1000, dtype: category
Categories (6, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 2000] < (2000, 3000] < (3000, 4000] < (4000, 5000]]

In [8]:
import pandas as pd

pd.cut(fee_transactions.fee,
       [1,500,1000,2000,3000,4000,5000]).value_counts()

fee
(2000, 3000]    218
(3000, 4000]    203
(1000, 2000]    202
(4000, 5000]    195
(1, 500]        100
(500, 1000]      82
Name: count, dtype: int64

In [9]:
import pandas as pd

pd.cut(fee_transactions.fee,
       [1,500,1000,2000,3000,4000,5000]).value_counts(normalize=True)*100

fee
(2000, 3000]    21.8
(3000, 4000]    20.3
(1000, 2000]    20.2
(4000, 5000]    19.5
(1, 500]        10.0
(500, 1000]      8.2
Name: proportion, dtype: float64

In [11]:
pd.qcut(fee_transactions.fee, [0.3,0.5,.7,.9,1]).value_counts(normalize=True)*100

fee
(1560.299, 2479.0]    28.571429
(2479.0, 3526.6]      28.571429
(3526.6, 4471.1]      28.571429
(4471.1, 4998.0]      14.285714
Name: proportion, dtype: float64

In [12]:
students_df.head()

   roll_no   name father            course date_of_admission    fee
0        1  Alice    Bob           Physics        2023-01-10  10000
1        2  Brian  Steve         Chemistry        2023-02-12  11000
2        3  Chloe    Tim           Biology        2023-03-14  12000
3        4  David   Rick       Mathematics        2023-04-10  13000
4        5    Eva   John  Computer Science        2023-05-16  14000

#filter on columns

* &, |, ~ Syntax:

dataframe[(dataframe.column1=='value1') & (dataframe.column2=='value2')]

    * string columns
    * numeric columns
    * datetime columns

In [2]:
students_df.head(10)

NameError: name 'students_df' is not defined

In [17]:
students_df['course'] #== Physcis

0             Physics
1           Chemistry
2             Biology
3         Mathematics
4    Computer Science
5           Economics
6             History
7           Geography
8             English
9                 Art
Name: course, dtype: object

In [21]:
students_df[students_df['course'] == "Physics"]

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [22]:
students_df[students_df['course'].str.lower() == "Physics"]

Empty DataFrame
Columns: [roll_no, name, father, course, date_of_admission, fee]
Index: []

In [23]:
students_df['course'].str.lower().str.contains('cs')

0     True
1    False
2    False
3     True
4    False
5     True
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [25]:
students_df[(students_df['course'].str.lower().str.contains('cs')) & (students_df['fee']>=14000) ]

   roll_no   name father     course date_of_admission    fee
5        6  Frank    Tom  Economics        2023-06-21  15000

In [28]:
students_df['course'].str.lower().str.contains('cs') & students_df['course'].str.lower().str.contains('r')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [29]:
students_df['course'].str.lower().str.contains('cs') | students_df['course'].str.lower().str.contains('r')

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: course, dtype: bool

In [8]:
students_df[students_df['course'].str.lower().str.contains('cs') | students_df['course'].str.lower().str.contains('r')]

   roll_no   name   father     course date_of_admission    fee
0        1  Alice      Bob    Physics        2023-01-10  10000
1        2  Brian    Steve  Chemistry        2023-02-12  11000
3        4  David     Rick    Physics        2023-04-10  13000
4        5    Eva     John    Physics        2023-05-16  14000
5        6  Frank      Tom  Economics        2023-06-21  15000
6        7  Grace    Harry    History        2023-07-25  16000
7        8  Henry  Charles  Geography        2023-08-17  17000
9       10   Jack     Noah        Art        2023-10-05  19000

In [11]:
students_df['date_of_admission']

0   2023-01-10
1   2023-02-12
2   2023-03-14
3   2023-04-10
4   2023-05-16
5   2023-06-21
6   2023-07-25
7   2023-08-17
8   2023-09-10
9   2023-10-05
Name: date_of_admission, dtype: datetime64[ns]

# apply filter on date column

* dataframe.column.dt

In [12]:
students_df['date_of_admission']

0   2023-01-10
1   2023-02-12
2   2023-03-14
3   2023-04-10
4   2023-05-16
5   2023-06-21
6   2023-07-25
7   2023-08-17
8   2023-09-10
9   2023-10-05
Name: date_of_admission, dtype: datetime64[ns]

In [13]:
dir(students_df['date_of_admission'].dt)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__frozen',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_add_delegate_accessors',
 '_constructor',
 '_delegate_method',
 '_delegate_property_get',
 '_delegate_property_set',
 '_dir_additions',
 '_dir_deletions',
 '_freeze',
 '_get_values',
 '_hidden_attrs',
 '_parent',
 '_reset_cache',
 'as_unit',
 'ceil',
 'date',
 'day',
 'day_name',
 'day_of_week',
 'day_of_year',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'floor',
 'freq',
 'hour',
 'is_leap_year',
 'is_month_end',
 'is_month_start',
 'is_quarter_end',
 'is_quarter_start',
 'is_year_end',
 'is_year_start',
 'isocalendar',
 'microsecond',
 'minute',
 'month',
 'month_name',
 'nanosecond',
 'normalize',
 'quarter',
 'round',
 'second',
 'strftime',
 'time',
 'timetz',
 'to_period',
 'to_pydatetime',
 'tz',
 'tz_convert',
 'tz_localize',
 'unit',
 'weekday',
 'year']

In [14]:
[i for i in dir(students_df['date_of_admission'].dt) if "_" not in i ]

['ceil',
 'date',
 'day',
 'dayofweek',
 'dayofyear',
 'daysinmonth',
 'floor',
 'freq',
 'hour',
 'isocalendar',
 'microsecond',
 'minute',
 'month',
 'nanosecond',
 'normalize',
 'quarter',
 'round',
 'second',
 'strftime',
 'time',
 'timetz',
 'tz',
 'unit',
 'weekday',
 'year']

In [26]:
students_df['date_of_admission'].dt.year
students_df['date_of_admission'].dt.month
students_df['date_of_admission'].dt.weekday
students_df['date_of_admission'].dt.day
students_df['date_of_admission'].dt.day_of_week
students_df['date_of_admission'].dt.hour
students_df['date_of_admission'].dt.second
students_df['date_of_admission'].dt.microsecond
students_df['date_of_admission'].dt.tz
students_df['date_of_admission'].dt.tz_localize
students_df['date_of_admission'].dt.tz_convert

# apply filter on date column
    * dataframe.column.dt
    * dt.strtime
    * dt.strptime

The `strftime` method in pandas is used to format datetime objects as per the specified date and time format. It's part of the `datetime` accessor (`dt`) for pandas Series objects that contain datetime-like values. This method allows for formatting datetime values using specific format codes that represent various components of a date and time (such as year, month, day, hour, minute, second).

Here's a list of common symbols used in the `strftime` method in pandas for formatting datetime objects:

- `%a`: Abbreviated weekday name.
- `%A`: Full weekday name.
- `%w`: Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
- `%d`: Day of the month as a zero-padded decimal number.
- `%b`: Abbreviated month name.
- `%B`: Full month name.
- `%m`: Month as a zero-padded decimal number.
- `%y`: Year without century as a zero-padded decimal number.
- `%Y`: Year with century as a decimal number.
- `%H`: Hour (24-hour clock) as a zero-padded decimal number.
- `%I`: Hour (12-hour clock) as a zero-padded decimal number.
- `%p`: Locale’s equivalent of either AM or PM.
- `%M`: Minute as a zero-padded decimal number.
- `%S`: Second as a zero-padded decimal number.
- `%f`: Microsecond as a decimal number, zero-padded on the left.
- `%z`: UTC offset in the form ±HHMM[SS[.ffffff]] (empty string if the object is naive).
- `%Z`: Time zone name (empty string if the object is naive).
- `%j`: Day of the year as a zero-padded decimal number.
- `%U`: Week number of the year (Sunday as the first day of the week) as a zero padded decimal number. All days in a new year preceding the first Sunday are considered to be in week 0.
- `%W`: Week number of the year (Monday as the first day of the week) as a zero padded decimal number. All days in a new year preceding the first Monday are considered to be in week 0.
- `%c`: Locale’s appropriate date and time representation.
- `%x`: Locale’s appropriate date representation.
- `%X`: Locale’s appropriate time representation.
- `%G`: ISO 8601 year with century representing the year that contains the greater part of the ISO week (`%V`).
- `%u`: ISO 8601 weekday as a decimal number where 1 is Monday.
- `%V`: ISO 8601 week number as a decimal number (with Monday as the first day of the week).

To use these symbols, you would typically pass them as part of a string to the `strftime` method, like so: `dataframe['column'].dt.strftime('%Y-%m-%d')`, which would format the dates in the 'column' as 'Year-Month-Day'.

In [27]:
from datetime import datetime

date = datetime.now()
date

datetime.datetime(2024, 3, 2, 23, 18, 54, 256530)

In [29]:
s1 : pd.Series = pd.Series([date])
s1

0   2024-03-02 23:18:54.256530
dtype: datetime64[ns]

In [36]:
s1.dt.strftime("%Y/%m/%d %I %b %B")

0    2024/03/02 11 Mar March
dtype: object

In [38]:
s2 : pd.Series = pd.Series(["01 NOV 2023", "01 Nov 2024", "01 Jan 2022"])
s2

0    01 NOV 2023
1    01 Nov 2024
2    01 Jan 2022
dtype: object

In [39]:
s2.apply(lambda x: datetime.strptime(x, "%d %b %Y")) # STRING TO DATETIME OBJECT

0   2023-11-01
1   2024-11-01
2   2022-01-01
dtype: datetime64[ns]

# GROUP BY
* dataframe.group(["column1", "column2"])
* dataframe.groupby(["column1", "column2"]).aggregate([min,max])
* dataframe.groupby(["column1", "column2"]).apply(function())

In [41]:
students_df.groupby(["course"])

In [42]:
list(students_df.groupby(["course"]))

[(('Art',),
     roll_no  name father course date_of_admission    fee
  9       10  Jack   Noah    Art        2023-10-05  19000),
 (('Biology',),
     roll_no   name father   course date_of_admission    fee
  2        3  Chloe    Tim  Biology        2023-03-14  12000),
 (('Chemistry',),
     roll_no   name father     course date_of_admission    fee
  1        2  Brian  Steve  Chemistry        2023-02-12  11000),
 (('Economics',),
     roll_no   name father     course date_of_admission    fee
  5        6  Frank    Tom  Economics        2023-06-21  15000),
 (('English',),
     roll_no    name  father   course date_of_admission    fee
  8        9  Isabel  Oliver  English        2023-09-10  18000),
 (('Geography',),
     roll_no   name   father     course date_of_admission    fee
  7        8  Henry  Charles  Geography        2023-08-17  17000),
 (('History',),
     roll_no   name father   course date_of_admission    fee
  6        7  Grace  Harry  History        2023-07-25  16000),
 (('Physics',),
     roll_no   name father   course date_of_admission    fee
  0        1  Alice    Bob  Physics        2023-01-10  10000
  3        4  David   Rick  Physics        2023-04-10  13000
  4        5    Eva   John  Physics        2023-05-16  14000)]

In [43]:
list(students_df.groupby(["course"]))[0]

(('Art',),
    roll_no  name father course date_of_admission    fee
 9       10  Jack   Noah    Art        2023-10-05  19000)

In [44]:
list(students_df.groupby(["course"]))[0][1]

   roll_no  name father course date_of_admission    fee
9       10  Jack   Noah    Art        2023-10-05  19000

In [45]:
list(students_df.groupby(["course"]))[0]

(('Art',),
    roll_no  name father course date_of_admission    fee
 9       10  Jack   Noah    Art        2023-10-05  19000)

In [50]:
for group in list(students_df.groupby(["course"])): 
    display(group[0])
    display(group[1])
    print("================================")

('Art',)

   roll_no  name father course date_of_admission    fee
9       10  Jack   Noah    Art        2023-10-05  19000

================================

('Biology',)

   roll_no   name father   course date_of_admission    fee
2        3  Chloe    Tim  Biology        2023-03-14  12000

================================

('Chemistry',)

   roll_no   name father     course date_of_admission    fee
1        2  Brian  Steve  Chemistry        2023-02-12  11000

================================

('Economics',)

   roll_no   name father     course date_of_admission    fee
5        6  Frank    Tom  Economics        2023-06-21  15000

================================

('English',)

   roll_no    name  father   course date_of_admission    fee
8        9  Isabel  Oliver  English        2023-09-10  18000

================================

('Geography',)

   roll_no   name   father     course date_of_admission    fee
7        8  Henry  Charles  Geography        2023-08-17  17000

================================

('History',)

   roll_no   name father   course date_of_admission    fee
6        7  Grace  Harry  History        2023-07-25  16000

================================

('Physics',)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000

================================

In [55]:
for group in list(students_df.groupby([students_df["date_of_admission"].dt.strftime("%Y")])):
    display(group[0])
    display(group[1])
    print("================================")

('2023',)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

================================

In [56]:
for group in list(students_df.groupby([students_df["date_of_admission"].dt.strftime("%B")])):
    display(group[0])
    display(group[1])
    print("================================")

('April',)

   roll_no   name father   course date_of_admission    fee
3        4  David   Rick  Physics        2023-04-10  13000

================================

('August',)

   roll_no   name   father     course date_of_admission    fee
7        8  Henry  Charles  Geography        2023-08-17  17000

================================

('February',)

   roll_no   name father     course date_of_admission    fee
1        2  Brian  Steve  Chemistry        2023-02-12  11000

================================

('January',)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

================================

('July',)

   roll_no   name father   course date_of_admission    fee
6        7  Grace  Harry  History        2023-07-25  16000

================================

('June',)

   roll_no   name father     course date_of_admission    fee
5        6  Frank    Tom  Economics        2023-06-21  15000

================================

('March',)

   roll_no   name father   course date_of_admission    fee
2        3  Chloe    Tim  Biology        2023-03-14  12000

================================

('May',)

   roll_no name father   course date_of_admission    fee
4        5  Eva   John  Physics        2023-05-16  14000

================================

('October',)

   roll_no  name father course date_of_admission    fee
9       10  Jack   Noah    Art        2023-10-05  19000

================================

('September',)

   roll_no    name  father   course date_of_admission    fee
8        9  Isabel  Oliver  English        2023-09-10  18000

================================

In [57]:
students_df.groupby([students_df["date_of_admission"].dt.strftime("%B")])